# DetachChord Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..DetachChord Method
Truss Class See Also
---
Detach a truss's specific chord from the element to which it is attached.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void DetachChord(
	TrussChordLocation location
)
```

Visual Basic
---
```text
Public Sub DetachChord ( _
	location As TrussChordLocation _
)
```

Visual C++
---
```text
public:
void DetachChord(
	TrussChordLocation location
)
```

# ### Parameters
location
    Type: Autodesk.Revit.DB.Structure..::..TrussChordLocationThe chord.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace